Repository: CBke/xfwm4
Catalog: po/*.po
Languages: am

source: Workspace Margins
am: የስራ ገበታ ድንበር

source: Margins are areas on the edges of the screen where no window will be placed
am: እንዚህ ድንበሮች ማለት በስክሪኑ ጠርዝ ላይ ያሉ ምንም መስኮት የማይቀመጥባቸው ማለት ነው

source: Left :
am: ግራ፦

source: Right :
am: ቀኝ፦

source: Top :
am: ላይ፦

source: Bottom :
am: ታች፦

source: Button Label|Workspaces and Margins
am: የአዝራር ስም| የስራ ገበታ እና ድንበሮች

source: Workspaces and Margins
am: የስራ ቦታና ድንበር

source: Workspaces
am: የስራ ገበታ

source: Margins
am: ድንበሮች

source: None
am: ምንም

source: Window Manager Tweaks
am: የመስኮት አስተዳዳሪ ማሰማመር

source: Skip windows that have "skip pager" or "skip taskbar" properties set
am: የ"skip pager" ወይም "skip taskbar" ባህሪዎች የተሰየመባቸውን መስኮቶች ዝለል።

source: Include hidden (i.e. iconified) windows
am: የተደበቁ (በምልክት ይተተኩ) መኮቶችን ጫምር

source: Cycle through windows from all workspaces
am: ሁሉም የስራ ገበታ ላይ ያሉ መስኮቶችን አስስ

source: Cycling
am: መዘወር

source: Activate focus stealing prevention
am: ጥቋሚ መስረቅን ከልክል

source: Honor the standard ICCCM focus hint
am: የICCCM ጠቋሚ ዘዴን ደረጃ ተጠቀም

source: Focus
am: ጠቋሚ

source: Key used to grab and move windows
am: መስኮቶችን ይዞ መውሰጃ ቁልፍ

source: Raise windows when any mouse button is pressed
am: የትኛውም የአይጥ ቁልፍ ሲጫን መስኮትን አስነሳ

source: Hide frame of windows when maximized
am: ሲያድግ የመስኮት ፍሬምን ደብቅ

source: Restore original size of maximized windows when moving
am: ሲወሰድ ቀዳሚ የተለቀ መስኮት መጠንን አድርግ

source: Use edge resistance instead of windows snapping
am: ከመስኮት ማሰለፍ ይልቅ ጠርዝ ተቃርኖን ተጠቀም

source: Accessibility
am: ቀለልነት

source: Switch workspaces using the mouse wheel over the desktop
am: የአይጥ መዘውርን በገበታ ላይ በመጠቀ የስራ ገበታን ቀይር

source: Remember and recall previous workspace when switching via keyboard shortcuts
am: በፊደል ገበታ አማካይነት ሲቀየር የቀድሞውን የስራ ገበታ አስታውስ

source: Wrap workspaces depending on the actual desktop layout
am: ከገበታው አቀራረብ ላይ በመነሳት የስራ ገበታን እጠፍ

source: Wrap workspaces when the first or last workspace is reached
am: የመጀመሪያው ወይም የመጨረሻው የስራ ገበታ ሲደረስ የስራ ገበታን እጠፍ

source: Size|Small
am: መጠን|ትንሽ

source: Size|Large
am: መጠን| ትልቅ

source: Placement
am: ቦታ አያያዝ

source: Show shadows under regular windows
am: በመስኮት ስር ጥላ አሳይ

source: Show shadows under popup windows
am: በፖፕባይ መስኮት ስር ጥላ አሳይ

source: Opacity of window decorations
am: የመስኮቱ ጌጥ ውስጠ-ትይነት

source: Transparent
am: ብርሃን አሳላፊ

source: Opaque
am: ብርሃን አጋጅ

source: Opacity of inactive windows
am: በስራ ላይ ያልሆነ መስኮት ውስጠ አሳይነት

source: Opacity of windows during move
am: መስኮት ሲንቀሳቀስ ያለው ውስጠ አሳይነት

source: Opacity of windows during resize
am: መስኮት ሲመጠን ያለው ውስጠ አሳይነት

source: Opacity of popup windows
am: የፖፕባይ መስኮት ውስጠ አሳይነት

source: Button Label|Window Manager Tweaks
am: አዝራር መለዮ|መስኮት አስተዳዳሪ Tweaks

source: These settings cannot work with your current window manager (%s)
am: ባለዎት የምስኮት አስተዳዳሪ እነዚህ ስየማዎች አይሰሩም (%s)

source: Change name
am: ስም ቀይር

source: Workspace %d
am: የስራ ቦታ %d

source: Name:
am: ስም፦

source: Click on a workspace name to edit it
am: ለማረም በስራ ገበታው ላይ ይጠቁሙ

source: Number of workspaces:
am: የስራ ቦታ ቁጥሮች፦

source: Workspace names
am: የስራ ቦታ ስሞች

source: Menu
am: ምናሌ

source: Stick
am: ሰካ

source: Shade
am: ጥላ

source: Hide
am: ደብቅ

source: Maximize
am: አተልቅ

source: Close
am: ዝጋ

source: Shade window
am: መስኮትን አጥላ

source: Hide window
am: መስኮትን ደብቅ

source: Maximize window
am: መስኮትን አተልቅ

source: Nothing
am: ምንም

source: Left
am: ግራ

source: Center
am: ምሃከል

source: Right
am: ቀኝ

source: Click and drag buttons to change the layout
am: ገጽታውን ለመቀየር ጠቁመው ይጎትቱ

source: Active
am: በስራላይ

source: Title
am: አርዕስት

source: The window title, it cannot be removed
am: የመስኮት አርዕስት፣ ለሰረዝ አይችልም

source: Hidden
am: ድብቅ

source: Font Selection Dialog
am: የፊደል ቅርጽ መረጣ መጠይቅ

source: Window Manager
am: ማስኮት አስተዳዳሪ

source: Title font
am: የአርዕስት ፊደል-ቅርጽ

source: Title Alignment
am: የአርዕስት ስልፍ

source: Text alignment inside title bar :
am: በአርዕስት ማስጫ ላይ ያለ የጽሁፍ ሰልፍ፦

source: Button layout
am: የአዝራር አጣጣል

source: Style
am: ሙና

source: Window shortcuts
am: የመስኮት አቋራጭ

source: Command
am: ትዕዛዝ

source: Shortcut
am: አቋራጭ

source: Keyboard
am: ፊደል-ሠሌዳ

source: Focus model
am: የማነጣጠር ሞዴል

source: Click to focus
am: ለመጠቆም ይጫኑ

source: Focus follows mouse
am: ጠቋሚው አይጥን ይከተላል

source: Slow
am: ቀስ

source: Fast
am: ፈጠን

source: Automatically give focus to newly created windows
am: አዲስ ለተፈጠረ መስኮት ኢላማን ስጥ

source: New window focus
am: አዲስ መስኮት ጠቁም

source: Raise on focus
am: ሲጠቆም ይነሳ

source: Automatically raise windows when they receive focus
am: ኢላማ ሲሰጠው መስኮትን አስነሳ

source: Delay before raising focused window :
am: የተጠቆመ መስኮትን ከምንሳት በፊት ምን ያህል ይዘግይ?፦

source: Raise window when clicking inside application window
am: በፕሮግራሙ መስኮት ውስጥ ሲጠቆም መስኮቱን አስነሳ

source: Raise on click
am: ሲጫን ይነሳ

source: Windows snapping
am: መስኮት ማሰለፍ

source: Snap windows to screen border
am: መስኮትን ከስክሪን ወሰን ጋር ማሰለፍ

source: Snap windows to other windows
am: መስኮቶችን ከለሎች መስኮቶች አሰልፍ

source: Distance :
am: ርቀት፦

source: Distance|Small
am: ርቀት|ትንሽ

source: Distance|Wide
am: ርቀት|ሰፊ

source: Wrap workspaces
am: የስራ ቦታን እጠፍ

source: Wrap workspaces when the pointer reaches a screen edge
am: ጠቋሚው ስክሪን ጠርዝ ሲደርስ የስራ ገበታን እጠፍ

source: Wrap workspaces when dragging a window off the screen
am: መስኮትን ከስክሪኑ ወድያ ሲጎተት የስራ ገበታን እጠፍ

source: Edge Resistance :
am: ጠርዝ ተቃርኖ፦

source: Resistance|Small
am: ተቃርኖ|ትንሽ

source: Resistance|Wide
am: ተቃርኖ|ስፋት

source: Opaque move and resize
am: ሲመጠንና ሲንቀሳቀስ ጥቁር ይሁን

source: Display content of windows when resizing
am: ሲመጠን የመስኮቱ ይዘት ይታይ

source: Display content of windows when moving
am: ሲንቀሳቀስ የመስኮቱ ይዘት ይታይ

source: Double click action
am: ሁለቴ መጫን ተግባር

source: Action to perform when double clicking on title bar :
am: በአርዕስት ማስጫ ላይ ሁለቴ ሲጫን ምን ይገበር?፦

source: Advanced
am: ጠለቅ

source: Button Label|Window Manager
am: የአዝራር ስም| መስኮት አስተዳዳሪ

source: Do you really want to remove this keybinding theme ?
am: የዚህ ቁልፍ ማሰሪያ ጭብጥን በርግጥ መሰረዝ ይፈልጋሉ

source: Add keybinding theme
am: ቁልፍ ማሰሪያ ጭብጥን ጨምር

source: Enter a name for the theme:
am: የጭብጡን ስም ያስገቡ፦

source: A keybinding theme with the same name already exists
am: ይህ ስም ያለው ቁልፍ ማሰሪያ ጭብጥ ከበፊትም አለ

source: You have to provide a name for the keybinding theme
am: ለቁልፍ ማሰሪያ ጭብጥ ስም ሊሰጡት ይገባል

source: Window operations menu
am: የመስኮት ስራ ምናሌ

source: Cancel
am: ሰርዝ

source: Cycle windows
am: መስኮትን ፈትሽ

source: Close window
am: መስኮት ዝጋ

source: Maximize window horizontally
am: መስኮትን አግድም አተልቅ

source: Maximize window vertically
am: መስኮትን ሽቅብ አተልቅ

source: Stick window
am: መስኮትን ሰካ

source: Raise window
am: መስኮትን ከፍ አድርግ

source: Lower window
am: መስኮትን ዝቅ አድርግ

source: Toggle fullscreen
am: ሙሉ-ስክሪን አድርግ

source: Move window to upper workspace
am: መስኮቱን ወደላይኛው የስራ ገበታ ውሰድ

source: Move window to bottom workspace
am: መስኮቱን ወደታችናው የስራ ገበታ ውሰድ

source: Move window to left workspace
am: መስኮቱን ወደግራ የስራ ገበታ ውሰድ

source: Move window to right workspace
am: መስኮቱን ወደቀኝ የስራ ገበታ ውሰድ

source: Move window to previous workspace
am: መስኮቱን ወደቀድሞው የስራ ገበታ ውሰድ

source: Move window to next workspace
am: መስኮቱን ወደሚቀጥለው የስራ ገበታ ውሰድ

source: Show desktop
am: ገበታን አሳይ

source: Upper workspace
am: የላይኛው ስራ ቦታ

source: Bottom workspace
am: የታችኛው ስራ ቦታ

source: Left workspace
am: የግራ ስራ ቦታ

source: Right workspace
am: የቀኝ ስራ ቦታ

source: Previous workspace
am: የቀድሞው ስራ ቦታ

source: Next workspace
am: የሚቀጥለው ስራ ቦታ

source: Add workspace
am: የስራ ቦታ ጨምር

source: Move window to workspace %d
am: መስኮቱን ወደ%d ገበታ ውሰድ

source: Cannot open the theme directory !
am: የጭብጥ ዶሴን መክፈት አልተቻለም።

source: Cannot open %s : %s
am: %sን መክፈት አልተቻለም : %s

source: Cannot write in %s : %s
am: %s ላይ መጻፍ አልተቻለም: %s

source: Shortcut already in use ! Are you sure you want to use it ?
am: አቋራጩ በጥቅም ላይ ውሏል! ለመጠቀም እንደሚፈልጉ ርግጠኛ ነዎት?

source: Compose shortcut for :
am: ለ...አቋራጭ ሰይም፦

source: Compose shortcut
am: አቋራጭ ሰይም

source: No shortcut
am: አቋራጭ የለም

source: %s (on %s)
am: %s ( %s)

source: Ma_ximize
am: አተልቅ _x

source: Hide _all others
am: ሌላውን ሁሉ ደብቅ _a

source: S_how
am: አሳይ _h

source: _Shade
am: ጥላ ጣል _S

source: S_tick
am: ውጋ _t

source: Context _help
am: ወቅታዊ መመሪያ _h

source: Send to...
am: ለ...ላክ

source: _Close
am: ዝጋ _C

source: Destroy
am: አጥፋ

source: _Quit
am: ውጣ _Q

source: Restart
am: እንደገና አስጀምር

source: Workspace %i (%s)
am: የስራ ቦታ %i (%s)

source: Workspace %i
am: የስራ ቦታ %i

source: %s: GtkMenu failed to grab the pointer
am: %s: Gtkምናሌ ጠቋሚውን መያዝ አልቻለም

source: %s: Cannot allocate color %s
am: %s: %s ቀለምን መስጠት አልተቻለም

source: %s: Cannot parse color %s
am: %s: %s ቀለምን መተርጎም አልተቻለም

source: Window Manager Settings
am: መስኮት አስተዳዳሪ ስየማዎች

source: Xfce 4 Window Manager Settings
am: የሸፍሲ 4 የመስኮት አስተዳዳሪ ስየማዎች

source: Advanced Configuration
am: ጥልቅ ስንድት

source: Xfce 4 Window Manager Tweaks
am: የሸፍሲ 4 የመስኮት አስተዳዳሪ ስየማዎች

source: Workspaces Settings
am: የስራቦታ ስየማ

source: Xfce 4 Workspaces Settings
am: የሸፍሲ 4 የስራቦታ ስየማዎች
