Repository: CBke/xfwm4
Catalog: doc/manual/po/*.po
Languages: it

source: Xfce 4 Window Manager
it: Gestore delle finestre di Xfce 4

source: This manual describes @PACKAGE_NAME@ version @PACKAGE_VERSION@
it: Questo manuale descrive @PACKAGE_NAME@ versione @PACKAGE_VERSION@

source: Introduction
it: Introduzione

source: The Xfce 4 Window Manager is part of the <ulink url="http://www.xfce.org" type="html">Xfce Desktop Environment</ulink>. The actual command to run is <application>@PACKAGE_NAME@</application>. To run it in the background use <command><application>@PACKAGE_NAME@</application> --daemon</command>. The window manager is responsible for the placement of windows on the screen, provides the window decorations and allows you for instance to move, resize or close them.
it: Il gestore delle finestre di Xfce 4 è parte dell'<ulink url="http://www.xfce.org" type="html">ambiente Desktop Xfce</ulink>. Il comando per eseguirlo è <application>@PACKAGE_NAME@</application>. Per avviarlo in background utilizzare <command><application>@PACKAGE_NAME@</application> --daemon</command>. Il gestore delle finestre è responsabile del posizionamento delle finestre sullo schermo, fornisce le decorazioni per le finestre e permette all'utente di muoverle, ridimensionarle e chiuderle.

source: <application>@PACKAGE_NAME@</application> adheres strongly to the standards defined on <ulink url="http://www.freedesktop.org" type="html">freedesktop.org</ulink>. Consequently, special features such as making windows borderless, or providing an icon for the application must now be implemented in the application; you can no longer use the window manager to force different behaviour. One of the great features of <application>@PACKAGE_NAME@</application> is its themeability. The window decorations (borders, title bar and window buttons) can be configured by using window manager themes.
it: <application>@PACKAGE_NAME@</application> aderisce fortemente agli standard di <ulink url="http://www.freedesktop.org" type="html">freedesktop.org</ulink>. Di conseguenza alcune caratteristiche speciali come la possibilità di rendere le finestre senza bordi, o di fornire un'icona per l'applicazione devono essere implementate nell'applicazione stessa. Non è più possibile utilizzare il gestore di finestre per forzare un diverso comportamento. Una delle caratteristiche più importanti di <application>@PACKAGE_NAME@</application> è la possibilità di utilizzare i temi: le decorazioni delle finestre (bordi, barra del titolo e pulsanti della finestra) possono essere configurati utilizzando i temi del gestore delle finestre.

source: <application>@PACKAGE_NAME@</application> offers multihead support, for both xinerama and real multiscreen modes, useful when you have more than one monitor connected to your computer.
it: <application>@PACKAGE_NAME@</application> offre il supporto a più schermi, sia per xinerama sia per modalità reali multischermo; è utile quando si ha più di un monitor connesso al computer.

source: <application>@PACKAGE_NAME@</application> can be run stand-alone, but if you use it this way, you will need the <ulink url="xfce-mcs-manager.html" type="http">Xfce 4 Settings Manager</ulink> if you want GUI settings management. Tasks other than managing windows, like setting a background image or launching programs, need to be performed by other programs.
it: <application>@PACKAGE_NAME@</application> può essere eseguito "stand-alone", ma per usarlo in questo modo, sarà necessario il <ulink url="xfce-mcs-manager.html" type="http">gestore delle impostazioni di Xfce 4</ulink> per poter gestire le impostazioni dall'interfaccia grafica. Le operazioni diverse dalla gestione delle finestre, quali l'impostazione di uno sfondo per la scrivania o l'avvio di programmi, devono essere svolte da altre applicazioni.

source: <application>@PACKAGE_NAME@</application> includes its own compositing manager, which takes advantage of the new <ulink url="http://freedesktop.org/Software/xorg" type="html">X.org</ulink>'s server extensions. The compositor is like a WM on its own, it manages a stack of all windows, monitor all kinds on X event and reacts accordingly. Having the compositing manager embedded in the window manager also helps keeping the various visual effects in sync with window events. If you want to use the compositor, you have to build <application>@PACKAGE_NAME@</application> using the --enable-compositor configure option. In any case, you can disable the compositor on <application>@PACKAGE_NAME@</application> startup using the '--compositor=off' argument.
it: <application>@PACKAGE_NAME@</application> include un proprio gestore della composizione, che si avvale delle nuove estensioni del server di <ulink url="http://freedesktop.org/Software/xorg" type="html">X.org</ulink>. Il compositore è come un gestore delle finestre: gestisce un insieme di tutte le finestre, monitora tutti i tipi di eventi su X e reagisce di conseguenza. Avere il gestore della composizione incluso nel gestore delle finestre permette anche di mantenere sincronizzati gli effetti visivi con gli eventi delle finestre. Per utilizzare il compositore, è necessario compilare <application>@PACKAGE_NAME@</application> utilizzando l'opzione di configure --enable-compositor. In ogni caso, è possibile disabilitare il compositore all'avvio di <application>@PACKAGE_NAME@</application> utilizzando l'argomento --compositor=off.

source: Using <application>@PACKAGE_NAME@</application>
it: Utilizzare <application>@PACKAGE_NAME@</application>

source: Manage windows
it: Gestire le finestre

source: The window manager provides borders, a title bar and window buttons to application windows. The look is defined by the window manager theme.
it: Il gestore delle finestre fornisce i bordi, i pulsanti della finestra e una barra del titolo alle finestre delle applicazioni. L'aspetto è definito dal tema del gestore delle finestre.

source: In the default theme <application>@PACKAGE_NAME@</application> shows six buttons and a title on regular application windows. The six buttons perform these basic functions:
it: Nel tema predefinito <application>@PACKAGE_NAME@</application> mostra sei pulsanti e un titolo nelle finestre regolari delle applicazioni. I sei pulsanti eseguono le seguenti funzioni base:

source: <application>@PACKAGE_NAME@</application> title bar buttons
it: <application>@PACKAGE_NAME@</application> pulsanti della barra del titolo

source: <application>@PACKAGE_NAME@</application> title bar buttons and functions
it: <application>@PACKAGE_NAME@</application> funzioni e pulsanti della barra del titolo

source: You can open the window menu with a left-click on the menu button on the title bar, or with a right-click on the window title area itself.
it: Il menu della finestra può essere aperto con un clic del tasto sinistro del mouse sul pulsante del menu sulla barra del titolo, o con un clic del tasto destro sulla barra del titolo.

source: If you use <application>xftaskbar4</application>, you can open an action menu with a right-click on one of the taskbar entries; it includes several items among those available in the window menu.
it: Se si utilizza <application>xftaskbar4</application>, è possibile aprire un menu delle azioni con un clic con il tasto destro del mouse su uno degli elementi della barra delle applicazioni. il menu comprende diversi elementi fra cui quelli disponibili nel menu della finestra.

source: Give focus to a window
it: Mettere a fuoco una finestra

source: You need to give the focus to a window if you want it to receive keyboard and mouse input. Window decorations colors will change, following the focus. To obtain more details about focus options, please refer to the <ulink url="#focus">corresponding section</ulink> below.
it: È necessario fornire il fuoco a una finestra se si vuole che questa riceva i comandi di mouse e tastiera. I colori delle decorazioni della finestra cambieranno, seguendo il fuoco. Per avere maggiori informazioni a riguardo delle opzioni sul fuoco, fare riferimento alla seguente <ulink url="#focus">sezione dedicata</ulink>.

source: A keyboard shortcut allows to switch the focus from a window to others : Hold Alt and then you can press Tab repeatedly untill you get to the window you want to focus. If you use it, you will see a small popup showing the application name, its icon and the window title. Also <application>@PACKAGE_NAME@</application> will highlight the outline of the window that will receive the focus.
it: Una scorciatoia da tastiera permette di passare il fuoco da una finestra all'altra: tenere premuto il tasto «Alt» e premere poi «Tab» ripetutamente fino a quando non si arriva alla finestra che si vuole avere a fuoco. Con questo metodo verrà visualizzata una finestra a comparsa in cui vengono mostrati il nome dell'applicazione, la sua icona e il titolo della finestra. Inoltre <application>@PACKAGE_NAME@</application> evidenzierà la sagoma della finestra che riceverà il fuoco.

source: NOTE: the use of a keyboard shortcut in an application needs the application window to have the focus :)
it: NOTA: l'utilizzo di una scorciatoia da tastiera in una applicazione sottintende che la sua finestra abbia il fuoco.

source: Maximize / unmaximize windows
it: Massimizzare o demassimizzare le finestre

source: If you maximize a window, it will expand on your display and use all avaible space (as it is defined by <ulink url="xfdesktop.html#xfdesktop-workspace" type="http">workspace settings</ulink>). You can maximize a window either vertically, horizontally, or both at once.
it: Se si massimizza una finestra, questa si espanderà fino a occupare tutto lo spazio disponibile sullo schermo come definito dalle <ulink url="xfdesktop.html#xfdesktop-workspace" type="http">impostazioni dello spazio di lavoro</ulink>). È possibile massimizzare una finestra verticalmente, orizzontalmente o in entrambe le direzioni contemporaneamente.

source: To maximize a window, perform one of those actions:
it: Per massimizzare una finestra, eseguire una delle seguenti operazioni:

source: click the maximize button of the title bar
it: fare clic sul pulsante di massimizzazione nella barra del titolo

source: open the window menu from the title bar and choose the "maximize" item
it: aprire il menu della finestra dalla barra del titolo e scegliere la voce «Massimizza»

source: use Alt + F5 keyboard shortcut
it: usare la scorciatoia da tastiera «Alt + F5»

source: You can make any window appear in fullscreen mode (it will then use all the size of your screen without showing the window borders) by using the customizable Alt + F11 keyboard shortcut.
it: È possibile visualizzare qualsiasi finestra a tutto schermo (utilizzerà tutta la dimensione dello schermo senza mostrare i bordi della finestra) utilizzando la scorciatoia da tastiera personalizzabile «Alt + F11».

source: To maximize a window vertically :
it: Per massimizzare una finestra verticalmente:

source: middle-click the maximize button of the title bar
it: fare clic con il tasto centrale del mouse sul pulsante di massimizzazione nella barra del titolo

source: use Alt + F6 keyboard shortcut
it: usare la scorciatoia «Alt + F6»

source: To maximize a window horizontally :
it: Per massimizzare una finestra orizzontalmente:

source: right-click the maximize button of the title bar
it: fare clic con il tasto destro del mouse sul pulsante di massimizzazione nella barra del titolo

source: use Alt + F7 keyboard shortcut
it: usare la scorciatoia «Alt + F7»

source: When a window has been maximized in a way or another, it can be restored to its previous size doing one of these actions :
it: Quando una finestra è stata massimizzata in un qualsiasi modo, può essere riportata alla dimensione precedente eseguendo una delle seguenti operazioni:

source: click the unmaximize button of the title bar
it: facendo clic sul pulsante di demassimizzazione della barra del titolo

source: use the same keyboard shortcut once again
it: usando le stesse scorciatoie da tastiere un'altra volta

source: choose the "Unmaximize" item in the window menu
it: selezionando la voce «Demassimizza» dal menu della finestra

source: Resize windows
it: Ridimensionare le finestre

source: Although certain special windows can not be resized, you are able to resize most of them to fit your needs.
it: Anche se alcune finestre speciali non possono essere ridimensionate, la maggior parte di esse possono essere ridimensionate a proprio piacimento.

source: you can use the edges and corners of the window frame to modify its size, dragging them with the mouse
it: È possibile usare i bordi e gli angoli della cornice della finestra per modificarne la dimensione, trascinandoli con il mouse

source: you can use the Alt + right click shortcut while you hold the mouse pointer anywhere over the window frame; it will act as if you were dragging the bottom-right corner of the window
it: È possibile usare la scorciatoia «Alt + clic destro» mentre il puntatore del mouse si trova su un punto qualsiasi della sagoma della finestra; si comporterà come se si stesse trascinando l'angolo in basso a destra della finestra

source: you can use practical keyboard shortcuts : Shift + Alt + (up, down, right or left) Arrow
it: È possibile utilizzare delle pratiche scorciatoie da tastiera: Maiusc + Alt + Frecce (su, giù, sinistra, destra)

source: Hide / unhide windows
it: Nascondere e mostrare le finestre

source: You can hide a window performing one of these actions :
it: È possibile nascondere una finestra eseguendo una delle seguenti operazioni:

source: click the hide button of the title bar
it: facendo clic sul pulsante nascondi della barra del titolo

source: open the window menu from the title bar and choose the "Hide" item
it: aprendo il menu della finestra dalla barra del titolo e scegliendo la voce «Nascondi»

source: use Alt + F8 keyboard shortcut
it: usando la scorciatoia da tastiera «Alt + F8»

source: Alternatively, you can hide all windows of current workspace, excepted the one you are using, in only one action : click the menu button of the title bar and choose "Hide all others".
it: In alternativa, è possibile nascondere tutte le finestre dello spazio di lavoro corrente, a eccezione di quella che si sta utilizzando, con un'unica azione, facendo clic sul pulsante del menu della barra del titolo e scegliendo «Nascondi tutte le altre»

source: To "unhide" a window, you will have to select its name or its icon in one of those Xfce 4 components :
it: Per far ricomparire una finestra nascosta, si deve selezionare il suo nome o la sua icona in uno dei seguenti componenti di Xfce 4:

source: the list of windows, accessible with a middle-click on the desktop background. This list shows all opened windows, classified by workspaces. Windows that are currently hidden are marked between [ ].
it: nella lista delle finestre accessibile con un clic del tasto centrale del mouse sullo sfondo della scrivania; questa lista mostra tutte le finestre aperte, classificate per spazio di lavoro. Le finestre attualmente nascoste sono indicate fra parentesi quadre.

source: the <application>xfce4-iconbox</application>
it: nel <application>xfce4-iconbox</application>

source: Shade / unshade windows
it: Arrotolare o srotolare le finestre

source: If you "shade" a window, it will be reduced to the size of its title bar. The same repeated action makes a window to shade/unshade :
it: Se si "arrotola" una finestra, questa verrà ridotta alla dimensione della barra del titolo. La stessa operazione ripetuta permette di arrotolare o srotolare ciclicamente una finestra:

source: click the shade/unshade button of the title bar
it: fare clic sul pulsante arrotola/srotola della barra del titolo

source: open the window menu from the title bar and choose "Shade" or "Unshade" item
it: aprire il menu della finestra dalla barra del titolo e scegliere la voce «Arrotola» o «Srotola»

source: use the mouse scrollwheel while you hold the pointer over the title bar
it: usare la rotella del mouse mentre si mantiene il puntatore sulla barra del titolo

source: use the Alt + F9 keyboard shortcut
it: usare la scorciatoia da tastiera «Alt + F9»

source: Stick / unstick windows
it: Bloccare o sbloccare le finestre

source: If you "stick" a window, it will be visible at the same place on all your workspaces. The same repeated action make a window to stick/unstick :
it: Se si "blocca" una finestra, questa sarà visibile nella stessa posizione su tutti gli spazi di lavoro. La stessa operazione ripetuta permette di bloccare o sbloccare ciclicamente una finestra:

source: click the stick/unstick button of the title bar
it: fare clic sul pulsante blocca/sblocca della barra del titolo

source: open the window menu button from the title bar and choose "Stick" or "Unstick" item
it: aprire il menu della finestra sulla barra del titolo e scegliere la voce «Blocca» o «Sblocca»

source: use the Alt + F10 keyboard shortcut
it: usare la scorciatoia da tastiera «Alt + F10»

source: Raise / lower windows
it: Sollevare o abbassare le finestre

source: The "raise window" function makes a window frame appear above all the other frames. To raise a window, you can :
it: La funzione di "sollevamento" permette alla sagoma di una finestra di apparire davanti a tutte le altre. Per sollevare una finestra si può:

source: left click on its titlebar
it: fare clic con il tasto sinistro del mouse sulla sua barra del titolo

source: give the focus to the window, if the corresponding option is selected in the <ulink url="xfwm4.html#wm-focus" type="http">Keyboard and focus preferences dialog</ulink>
it: dare il fuoco alla finestra, se la corrispondente opzione è selezionata nella <ulink url="xfwm4.html#wm-focus" type="http">schermata delle preferenze di tastiera e fuoco</ulink>.

source: left click anywhere on its frame, if the corresponding option is selected in the <ulink url="xfwm4.html#wm-focus" type="http">Keyboard and focus preferences dialog</ulink>
it: fare clic in un punto qualsiasi della sua sagoma, se la corrispondente opzione è selezionata nella <ulink url="xfwm4.html#wm-focus" type="http">schermata delle preferenze di tastiera e fuoco</ulink>.

source: click on its label in the taskbar or the iconbox
it: fare clic sulla sua etichetta nella barra delle applicazioni o nell'iconbox

source: use the Shift + Alt + Page_Up keyboard shortcut (if the window is already focused)
it: usare la scorciatoia da tastiera Maiusc + Alt + PGgiù (se la finestra è già a fuoco)

source: You can make a window frame to always stay above all other windows by opening the window menu and selecting the "always on top" item.
it: È possibile far restare una finestra sempre sopra le altre aprendo il menu della finestra e selezionando la voce «Sempre in primo piano».

source: The "lower" function sends a window frame below all other frames. To "lower" a window, you can :
it: La funzione "Abbassa" porta la finestra al di sotto delle altre. Per abbassare una finestra si può:

source: middle-click on its title bar
it: fare clic con il tasto centrale del mouse sulla sua barra del titolo

source: use the Shift + Alt + Page_Down keyboard shortcut (if the window is focused)
it: usare la scorciatoia da tastiera Maiusc + Alt + PGgiù (se la finestra è a fuoco)

source: Move windows
it: Spostare le finestre

source: There are several ways to move windows :
it: È possibile spostare le finestre in vari modi:

source: left or right click on the title bar of the window and drag it
it: facendo clic con il tasto destro o sinistro del mouse sulla barra del titolo e trascinandola

source: use Alt + left click while the pointer is anywhere over the window frame and move the mouse
it: usando la combinazione «Alt + clic sinistro» mentre il puntatore è su un punto qualsiasi della sagoma della finestra e muovendo il mouse

source: use Control + Alt + Shift + (up, down, left or right) Arrow keyboard shortcut
it: usando la combinazione di tasti «Control + Alt + Maiusc + Frecce della tastiera (su, giù, sinistra, destra)»

source: Move a window to another workspace
it: Spostare una finestra su un altro spazio di lavoro

source: You can send a window to another workspace by performing one of these actions :
it: È possibile spostare una finestra in un altro spazio di lavoro eseguendo una delle seguenti azioni:

source: stick the window, move to another workspace, then unstick the window.
it: bloccare la finestra, spostarsi su un altro spazio di lavoro poi sbloccare la finestra

source: use the window menu and choose one of the "Send to" submenu items.
it: usare il menu della finestra e scegliere una delle sotto voci di «Invia a»

source: left or right click on the title bar of the window, drag it to the screen edge : the pointer will then go to the next workspace, still holding the window. Corresponding option needs to be selected in the <ulink url="xfwm4.html#wm_misc" type="http">Window Manager Preferences dialog</ulink>.
it: fare clic con il tasto destro o sinistro sulla barra del titolo della finestra, trascinarla verso il bordo dello schermo: il puntatore si sposterà nello spazio di lavoro successivo assieme alla finestra. L'opzione corrispondente deve essere selezionata nella <ulink url="xfwm4.html#wm_misc" type="http">schermata delle preferenze del gestore delle finestre</ulink>.

source: use keyboard shortcuts :
it: utilizzare le scorciatoie da tastiera:

source: Alt + Control + End will move a window to the next workspace
it: «Alt + Control + Fine» sposta la finestra allo spazio di lavoro successivo

source: Alt + Control + Home will move a window to the previous workspace
it: «Alt + Control + Home» sposta la finestra allo spazio di lavoro precedente

source: Alt + Control + Keypad-Number will move the current window to corresponding workspace
it: «Alt + Control + n° tastierino numerico» sposta la finestra corrente al corrispondente spazio di lavoro

source: use the <ulink url="xfce4-panel.html#switcher-item" type="http">graphical pager </ulink> by clicking on the representation of the window, and move it to the desired workspace.
it: usare il <ulink url="xfce4-panel.html#switcher-item" type="http">selettore grafico</ulink> facendo clic sulla rappresentazione della finestra e muoverla nello spazio di lavoro desiderato.

source: Close a window
it: Chiudere una finestra

source: To close a window :
it: Per chiudere una finestra

source: click the close button of the title bar
it: fare clic sul pulsante di chiusura nella barra del titolo

source: Open the window menu from the title bar and choose the "Close" item
it: aprire il menu della finestra dalla barra del titolo e scegliere la voce «Chiudi»

source: or use Alt + F4 keyboard shortcut
it: o usare la scorciatoia da tastiera «Alt + F4»

source: Customizing <application>@PACKAGE_NAME@</application>
it: Personalizzare <application>@PACKAGE_NAME@</application>

source: To open the Window Manager preferences dialog, click the button labelled "Window Manager" in the <ulink url="xfce-mcs-manager.html#manager-dialog" type="http">Xfce 4 Settings manager</ulink>. The dialog shows four tabs : Style, Keyboard, Focus, Advanced. All modifications will have an immediate effect on the behaviour of the selected module.
it: Per aprire la schermata delle preferenze del gestore delle finestre, fare clic sul pulsante identificato con «Gestore delle finestre» nel <ulink url="xfce-mcs-manager.html#manager-dialog" type="http">Gestore delle impostazioni di Xfce 4</ulink>. La schermata mostra quattro schede: stile, tastiera, fuoco e avanzate. Tutte le modifiche hanno un effetto immediato sul comportamento del modulo selezionato.

source: Decoration style
it: Stile della decorazione

source: Decoration style preferences
it: Preferenze dello stile di decorazione

source: The decoration style tab
it: La scheda dello stile di decorazione

source: Window style
it: Stile della finestra
