Repository: CBke/xfwm4
Catalog: doc/manual/po/*.po
Languages: it

source: The list on the left side of the dialog shows all avaible window decorations. The xfwm 4 module offers the choice between 4 different themes, but there are more than 60 supplementary themes avaible in xfwm4-themes extra package.
it: L'elenco sulla sinistra della schermata mostra tutte le decorazioni disponibili. Il modulo xfwm 4 offre la scelta tra 4 temi differenti, ma sono disponibili più di 60 temi aggiuntivi disponibili nel pacchetto xfwm4-theme.

source: Title font
it: Carattere del titolo

source: The "Font select" button shows the family font currently in use for the window title appearance. Click this button if you want to change it, and a "Font selection" dialog will appear. It works like the font selection dialog of the <ulink url="xfce-mcs-plugins.html#id2811474" type="http">user interface settings manager plugin</ulink>.
it: Il pulsante "Carattere del titolo" mostra la famiglia di carattere attualmente in uso per l'aspetto del titolo della finestra. Fare clic su questo pulsante se si desidera cambiarlo; verrà così visualizzata una finestra di "Selezione del tipo di carattere". Funziona come la finestra di selezione del carattere del <ulink url="xfce-mcs-plugins.html#id2811474" type="http">plugin di gestione delle impostazioni dell'interfaccia utente</ulink>.

source: Title alignment
it: Allineamento del titolo

source: Whatever the buttons layout is, you can choose the alignment of the title inside the title bar, selecting one of those simple options : align it to the left, center or right.
it: Qualsiasi sia la disposizione dei pulsanti, è possibile scegliere l'allineamento del titolo all'interno della barra del titolo, selezionando una delle seguenti semplici opzioni: allinea a sinistra, al centro o a destra.

source: Button layout
it: Disposizione dei pulsanti

source: The button layout configuration uses an easy drag and drop tool. Click and drag the buttons to change the layout. Drop a button in the "Hidden" area to remove a button from the titlebar. All modifications will have an immediate effect on the title bar buttons position.
it: La configurazione della disposizione dei pulsanti utilizza un semplice meccanismo a trascinamento. Fare clic e trascinare i pulsanti per cambiarne la disposizione. Spostare un pulsante nell'area identificata con "Nascosti" per rimuoverlo dalla barra del titolo. Tutte le modifiche hanno un effetto immediato sulla posizione dei pulsanti della barra del titolo.

source: Keyboard shortcuts
it: Scorciatoie da tastiera

source: Keyboard shortcuts preferences
it: Preferenze delle scorciatoie da tastiera

source: The keyboard shortcuts tab
it: La scheda delle scorciatoie

source: Keyboard Shortcuts
it: Scorciatoie da tastiera

source: The list on the left side of the dialog shows all avaible shortcuts themes, using the name of directories that contain a keythemerc file.
it: L'elenco sulla sinistra della finestra mostra tutti i temi delle scorciatoie disponibili utilizzando il nome delle cartelle che contengono un file keythemerc.

source: By default, there's only one theme : $(datadir)/themes/Default/xfwm4/keythemerc
it: Di default, è presente un solo tema: $(datadir)/themes/Default/xfwm4/keythemerc

source: In the default configuration the following keybindings are defined:
it: Nella configurazione predefinita sono definiti i seguenti collegamenti:

source: close window : Alt + F4
it: Chiudi finestra: Alt + F4

source: Maximize window : Alt + F5
it: Massimizza finestra: Alt + F5

source: Maximize vertically : Alt + F6
it: Massimizza verticalmente: Alt + F6

source: Maximize horizontally : Alt + F7
it: Massimizza orizzontalmente: Alt + F7

source: Hide window : Alt + F8
it: Nascondi finestra: Alt + F8

source: Shade window : Alt + F9
it: Arrotola finestra: Alt + F9

source: Stick window : Alt + F10
it: Blocca finestra: Alt + F10

source: Cycle windows focus : Alt + Tab
it: Scorri il fuoco tra le finestre: Alt + Tab

source: Move window : Control + Shift + Alt + Arrow (up, down, left, or right)
it: Sposta finestra: Control + Maiusc + Alt + Frecce (su, giù, sinistra, destra)

source: Resize window : Shift + Alt + Arrow (up, down, left, or right)
it: Ridimensiona finestra: Maiusc + Alt + Frecce (su, giù, sinistra, destra)

source: Raise window : Shift + Alt + Page_Up
it: Solleva finestra: Maiusc + Alt + PGsu

source: Lower window : Shift + Alt + Page_Down
it: Abbassa finestra: Maiusc + Alt + PGgiù

source: Toggle fullscreen : Alt + F11
it: Abilita/disabilita visualizzazione a tutto schermo: Alt + F11

source: Next workspace : Control + Alt + Arrow right arrow
it: Spazio di lavoro successivo: Control + Alt + Freccia destra

source: Previous workspace : Control + Alt + Arrow left
it: Spazio di lavoro precedente: Control + Alt + Freccia sinistra

source: Add a workspace : Alt + Insert
it: Aggiungi uno spazio di lavoro: Alt + Ins

source: Delete a workspace : Alt + Delete
it: Elimina uno spazio di lavoro: Alt + Canc

source: Go to workspace number N (1-9) : Control + F(N)
it: Va allo spazio di lavoro N (1-9): Control + F(N)

source: Move the window to previous|next workspace : Alt + Control + Home|End
it: Sposta la finestra al precedente (successivo) spazio di lavoro: Alt + Control + Home (Fine)

source: Move a window to workspace number N (1-9) : Alt + Control + keypad key number N
it: Sposta una finestra sullo spazio di lavoro N (1-9): Alt + Control + numero N sul tastierino numerico

source: Start xfhelp4 : Alt + F1
it: Avvia xfhelp4: Alt +F1

source: Start xfrun4 : Alt + F2
it: Avvia xfrun4: Alt + F2

source: Lock the screen : Alt + Control + Delete
it: Blocca lo schermo: Alt + Control + Canc

source: There are two lists on the right side of the dialog. The "Windows shortcuts" list shows the keyboard shortcuts which are used to drive the window manager. The "Command shortcuts" list shows the keyboard shortcuts which are aimed at launching applications. To modify one of the shortcuts, you have to double-click on it in the list, using the left button of your mouse, and compose your new shortcut when the "Compose shortcut" popup window appears.
it: Sono presenti due liste nella parte destra della schermata. La lista delle scorciatoie delle finestre mostra le scorciatoie da tastiera che vengono utilizzate per guidare il gestore delle finestre. La lista delle scorciatoie dei comandi mostra le scorciatoie da tastiera dedicate al lancio delle applicazioni. Per modificarne una, occorre fare un doppio clic sulla relativa voce nella lista usando il pulsante sinistro del mouse e inserire la nuova scorciatoia quando viene visualizzata la finestra a comparsa per la composizione della scorciatoia.

source: The compose shortcut popup
it: La finestra a comparsa della composizione della scorciatoia

source: If you want to create a new theme, create a directory like this one, for instance : $HOME/.themes/Custom/xfwm4/keythemerc, then select it in the list of available themes.
it: Per creare un nuovo tema, creare una cartella come questa (ad esempio $HOME/.themes/Custom/xfwm4/keythemer) poi selezionarla nella lista dei temi disponibili.

source: If you do not know the names of your keyboard modifier keys, you can launch the "xev" application from a terminal and test them.
it: Se non si conosce il nome dei tasti modificatori della propria tastiera, è possibile avviare l'applicazione "xev" dal terminale per eseguire una prova.

source: Focus preferences
it: Preferenze del fuoco

source: The Focus tab
it: La scheda del fuoco

source: Focus model
it: Modello di fuoco

source: A focused window receives the keyboard and mouse input. You have the choice between two focus models :
it: Una finestra a fuoco riceve i comandi da mouse e tastiera. È possibile scegliere tra due modelli di fuoco:

source: Click to focus : select this option if you want a window to receive the focus only when you click anywhere on its frame.
it: Fuoco al clic: selezionare questa opzione per fare in modo che la finestra riceva il fuoco solo quando si fa clic in un punto qualsiasi della sua sagoma.

source: Focus follow mouse : select this option if you want a window to receive the focus as soon as the mouse pointer is over its frame.
it: Il fuoco segue il mouse: selezionare questa opzione per fare in modo che una finestra riceva il fuoco non appena il puntatore del mouse è sopra alla sua sagoma.

source: New window focus
it: Fuoco per le nuove finestre

source: Selecting this option will automatically give the focus to newly created windows, without the need to click or move the mouse pointer.
it: Selezionando questa opzione il fuoco verrà fornito automaticamente alle nuove finestre create, senza che ci sia bisogno di fare clic o di muovere il puntatore del mouse.

source: Raise on focus
it: Sollevamento se a fuoco

source: If this option is selected, the frame of a newly focused window will automatically appear over all other frames, after an amount of time that you can adjust with the "delay" slider.
it: Se questa opzione è selezionata, la sagoma di una nuova finestra a fuoco apparirà automaticamente al di sopra delle altre dopo un certo tempo che può essere impostato con la barra di scorrimento denominata "ritardo".

source: Raise on click
it: Sollevamento al clic

source: Choose this option if you want a window to pass over the others when you click anywhere on its frame. If this option is not selected, you will have to click somewhere on its decorations (title bar, borders or corners) to raise it.
it: Selezionare questa opzione per fare in modo che la finestra venga posizionata al di sopra delle altre quando si fa clic in un punto qualsiasi della sua sagoma. Se questa opzione non è selezionata sarà necessario fare clic sulla sua decorazione (barra del titolo, bordi o angoli) per portarla in primo piano.

source: Advanced settings
it: Impostazioni avanzate

source: Advanced preferences
it: Preferenze avanzate

source: Advanced tab
it: Scheda avanzate

source: Windows snapping
it: Finestre magnetiche

source: You can choose the windows borders to be attracted by the borders of other windows, or by the screen edges, when they are moved. The distance from which this effect will be applied can be specified with the "Distance" slider.
it: È possibile fare in modo che i bordi di una finestra siano attratti dai bordi delle altre finestre, o dai bordi dello schermo quando vengono spostate. La distanza a cui si risente di questo effetto può essere impostata con la barra di scorrimento "Distanza"

source: Wrap workspaces
it: Scorrimento degli spazi di lavoro

source: Select the first option if you want to switch to the next workspace when the mouse pointer reaches the screen edges. Select the second one if you want the same behaviour while dragging a window. You can specify the screen edges resistance using the corresponding slider.
it: Selezionare la prima opzione per passare allo spazio di lavoro adiacente quando il puntatore del mouse raggiunge i bordi dello schermo. Selezionare la seconda opzione per avere lo stesso comportamento quando si trascina una finestra. Con la corrispondente barra di scorrimento è possibile impostare la resistenza dei bordi.

source: Opaque move and resize
it: Movimento e ridimensionamento opacizzato

source: Two options allow you to choose if the content of a window will appear or not, when you move or resize it (not displaying the content will save some system resources).
it: Due opzioni permettono di scegliere se il contenuto di una finestra debba essere visualizzato o no durante una operazione di spostamento o ridimensionamento (non visualizzando il contenuto, vengono risparmiate alcune risorse di sistema).

source: Double click action
it: Azione per il doppio clic

source: Select what must be the behaviour of the window manager when you double-click on the title bar of a window : shade window, hide window, maximize window or none.
it: Imposta il comportamento del gestore delle finestre quando si fa doppio clic sulla barra del titolo di una finestra: arrotolare la finestra, nascondere la finestra, massimizzare la finestra o niente.

source: Managing workspaces
it: Gestire gli spazi di lavoro

source: <application>@PACKAGE_NAME@</application> also manages workspaces. There is a special settings dialog to change the workspace properties. You can start it by choosing <emphasis>Workspaces and Margins</emphasis> from the the <ulink url="xfce-mcs-manager.html#manager-dialog" type="http">settings manager dialog</ulink>. The dialog contains two tab folders where you can change workspace settings and desktop margins.
it: <application>@PACKAGE_NAME@</application> gestisce anche gli spazi di lavoro. C'è una particolare finestra delle impostazioni per modificare le proprietà degli spazi di lavoro. È possibile aprirla selezionando <emphasis>Spazi di lavoro e margini</emphasis> dalla finestra del <ulink url="xfce-mcs-manager.html#manager-dialog" type="http">gestore delle impostazioni</ulink>. La finestra contiene due schede tramite le quali è possibile modificare le impostazioni degli spazi di lavoro e i margini della scrivania.

source: Workspaces settings
it: Impostazioni degli spazi di lavoro

source: Workspace Settings
it: Impostazioni dello spazio di lavoro

source: Shows workspace settings tab folder.
it: La scheda delle impostazioni degli spazi di lavoro

source: Workspaces
it: Spazi di lavoro

source: This option allows you too choose the number of workspaces you want to use (between 1 and 32).
it: Questa opzione permette di selezionare il numero di spazio di lavoro che si intende utilizzare (1-32).

source: Worspace names
it: Nomi degli spazi di lavoro

source: This field shows the list of avaible workspaces. If you want to edit the name of one of them, click its number and a fill the entry of the dialog that will then appear. When it's done, click the "Apply" button, or just press the Enter key, to return to the list.
it: Questo campo mostra l'elenco degli spazi di lavoro disponibili. Per modificare il nome di uno di essi, fare clic sul suo numero e compilare il campo che viene mostrato. Al termine premere il pulsante «Applica» o alternativamente premere il tasto «Enter», per ritornare all'elenco.

source: Workspaces margins
it: Margini degli spazi di lavoro

source: The workspace margins dialog
it: la finestra dei margini degli spazi di lavoro

source: The workspace margins tab folder
it: La scheda dei margini degli spazi di lavoro

source: To open the Workspace Margins dialog, click the button labelled "Workspaces and Margins" in the <ulink url="xfce-mcs-manager.html#manager-dialog" type="http">settings manager dialog</ulink> and choose the tab labelled "Margins".
it: Per aprire la schermata relativa ai margini degli spazi di lavoro, fare clic sul pulsante denominato "Spazi di lavoro e margini" nella finestra del <ulink url="xfce-mcs-manager.html#manager-dialog" type="http">gestore delle impostazioni</ulink> e scegliere la scheda denominata "Margini".

source: Margins are areas on the edges of the screen that maximized windows won't cover. You can adjust the size, in pixels, of all margins (left, right, top and bottom). Use this feature, for example, if you do not want maximized windows to overlap panel or iconbox frames.
it: I margini sono delle aree ai bordi dello schermo che le finestre non andranno a occupare. Se ne può modificare la dimensione, in pixel, a sinistra, destra, in alto e in basso. Questa funzione è utile quando, ad esempio, non si vuole che le finestre massimizzate vadano a sovrapporsi alle cornici di pannelli o a iconbox.

source: About <application>@PACKAGE_NAME@</application>
it: Informazioni su <application>@PACKAGE_NAME@</application>

source: <application>@PACKAGE_NAME@</application> was written Olivier Fourdan (<email>fourdan@xfce.org</email>). To find more information, please visit the <ulink url="http://www.xfce.org" type="http">Xfce web site</ulink>.
it: <application>@PACKAGE_NAME@</application> è stata scritta da Olivier Fourdan (<email>fourdan@xfce.org</email>). Per ricevere ulteriori informazioni, visitare il <ulink url="http://www.xfce.org" type="http">sito web di Xfce</ulink>.

source: To report a bug or make a suggestion regarding this application or this manual, use the bug tracking system at <ulink url="http://bugzilla.xfce.org/" type="http">http://bugzilla.xfce.org/</ulink>.
it: Per segnalare un problema o per avanzare una proposta relativa a questo programma o al manuale, utilizzare il sistema di tracciamento dei bug all'indirizzo <ulink url="http://bugzilla.xfce.org/" type="http">http://bugzilla.xfce.org/</ulink>.

source: If you have questions about the use or installation of this package, please ask on the <ulink url="http://lunar-linux.org/mailman/listinfo/xfce" type="http">xfce</ulink> mailing list. Development discussion takes place on the <ulink url="http://lunar-linux.org/mailman/listinfo/xfce4-dev" type="http">xfce4-dev</ulink> mailing list.
it: Se si hanno domande relative all'utilizzo o all'installazione di questo pacchetto, rivolgersi alla lista di discussione di <ulink url="http://lunar-linux.org/mailman/listinfo/xfce" type="http">xfce</ulink>. Le discussioni relative allo sviluppo si svolgono nella lista di discussione <ulink url="http://lunar-linux.org/mailman/listinfo/xfce4-dev" type="http">xfce4-dev</ulink>.

source: This program is distributed under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
it: Questo programma è distribuito nel rispetto dei termini della licenza GNU GPL (General Public License) come pubblicata dalla Free Software Foundation, sia questa la versione 2 o, a propria scelta, una qualsiasi versione successiva.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
it: Con il programma dovrebbe essere stata anche fornita una copia della GNU General Public License; se così non fosse, scrivere alla: Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: translator-credits
it: Cristian Marchi <cri.penta@gmail.com>, 2010.
